yoelslist-backend/app/controllers/application_controller.rb

    def current_user
        if decoded_token
          # Using the decoded token, grab the user_id stored within it and find a user
          user_id = decoded_token[0]['user_id']
          @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]