yoelslist-backend/app/controllers/auth_controller.rb

    def create
        # Find the user by the params sent in through the login fetch params
        @user = User.find_by(email: user_login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "yoelyukalo@gmail.com"], ["LIMIT", 1]]

    def auto_login
        @token = params[:token]
        # byebug
        user = User.find(JWT.decode(@token, "put your secret password here", true, algorithm: 'HS256')[0]["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]