yoelslist-backend/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "pic") VALUES (?, ?, ?, ?, ?, ?)  [["title", "yoel"], ["body", ""], ["user_id", 5], ["created_at", "2021-03-08 22:28:21.489666"], ["updated_at", "2021-03-08 22:28:21.489666"], ["pic", ""]]

  def show
    @post = Post.find(params[:id]) # pulls id from /posts/:id in url
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id])
    if current_user == @post.user && @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "cost" = ?, "body" = ?, "updated_at" = ?, "pic" = ? WHERE "posts"."id" = ?  [["title", ""], ["cost", 0.0], ["body", ""], ["updated_at", "2021-03-08 21:38:18.346802"], ["pic", ""], ["id", 6]]

  def destroy
    @post = Post.find(params[:id])
    if @post.user == current_user
      @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]